In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:oracle@localhost/sample

In [3]:
%%sql

show tables;

 * mysql+mysqlconnector://root:***@localhost/sample
2 rows affected.

[('demo',), ('demos',)]

In [4]:
%%sql

select * from demos

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[(1, 'purvaja')]

In [7]:
%%sql

show databases;

 * mysql+mysqlconnector://root:***@localhost/sample
9 rows affected.

[('ds_project',),
 ('gl_da_cloud',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('purvaja',),
 ('sample',),
 ('shree',),
 ('sys',)]

In [8]:
%%sql

use ds_project;

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [13]:
%%sql

create table test(sno int , name varchar(100));

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [14]:
%%sql 

insert into test (sno,name) values(1 , "Shree Purvaja");

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [16]:
%%sql 

insert into test (sno,name) values(2,"Gowtham");

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [17]:
%%sql 

select * from test;

 * mysql+mysqlconnector://root:***@localhost/sample
2 rows affected.

[(1, 'Shree Purvaja'), (2, 'Gowtham')]

In [22]:
%%sql 

update test set name='D Gowtham' where sno=2;

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [23]:
%%sql 

select * from test;

 * mysql+mysqlconnector://root:***@localhost/sample
2 rows affected.

[(1, 'Shree Purvaja'), (2, 'D Gowtham')]

In [25]:
%%sql

insert into test(sno,name) values(3,"Classy");

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [26]:
%%sql

select * from test;

 * mysql+mysqlconnector://root:***@localhost/sample
3 rows affected.

[(1, 'Shree Purvaja'), (2, 'D Gowtham'), (3, 'Classy')]

In [27]:
%%sql

delete from test where sno=3;

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [28]:
%%sql

select * from test;

 * mysql+mysqlconnector://root:***@localhost/sample
2 rows affected.

[(1, 'Shree Purvaja'), (2, 'D Gowtham')]

In [29]:
%%sql 

truncate table test;

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [30]:
%%sql

select * from test;

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [32]:
%%sql 

drop table test;

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [33]:
%%sql

create table employees(
    employee_id int primary key,
    first_name varchar(50) not null,
    second_name varchar(50) not null,
    hire_date date not null,
    salary decimal(10,2)
);

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [40]:
%%sql

insert into employees(employee_id,first_name,second_name,hire_date,salary) values (1,"Shree","Purvaja","2025-06-26",100000);

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [42]:
%%sql

insert into employees(employee_id,first_name,second_name,hire_date,salary) values (2,"Gowtham","D","2025-06-21",90000);

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [43]:
%%sql

insert into employees(employee_id,first_name,second_name,hire_date,salary) values (3,"Akshitaa","S S","2025-08-24",80000);

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [45]:
%%sql 
select * from employees;

 * mysql+mysqlconnector://root:***@localhost/sample
3 rows affected.

[(1, 'Shree', 'Purvaja', datetime.date(2025, 6, 26), Decimal('100000.00')),
 (2, 'Gowtham', 'D', datetime.date(2025, 6, 21), Decimal('90000.00')),
 (3, 'Akshitaa', 'S S', datetime.date(2025, 8, 24), Decimal('80000.00'))]

In [47]:
%%sql
# CTAS

create table ctas_table_data as
select 
    employee_id,
    first_name,
    second_name,
    salary
from employees
where salary > 80000;

 * mysql+mysqlconnector://root:***@localhost/sample
2 rows affected.

[]

In [48]:
%%sql 
select * from ctas_table_data;

 * mysql+mysqlconnector://root:***@localhost/sample
2 rows affected.

[(1, 'Shree', 'Purvaja', Decimal('100000.00')),
 (2, 'Gowtham', 'D', Decimal('90000.00'))]

In [49]:
%%sql 
drop table ctas_table;

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [53]:
%%sql

WITH high_salary_cte AS (
    SELECT employee_id, first_name, second_name, hire_date, salary
    FROM employees
    WHERE salary > 90000
)

SELECT * FROM high_salary_cte;

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[(1, 'Shree', 'Purvaja', datetime.date(2025, 6, 26), Decimal('100000.00'))]

In [54]:
%%sql

create table emp(
   employee_id int primary key,
    first_name varchar(50) not null,
    second_name varchar(50) not null,
    hire_date date not null,
    salary decimal(10,2)
);

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [56]:
%%sql

alter table emp add email varchar(100);

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [57]:
%%sql

desc emp;

 * mysql+mysqlconnector://root:***@localhost/sample
6 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('second_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, ''),
 ('email', 'varchar(100)', 'YES', '', None, '')]

In [59]:
%%sql

alter table emp drop column second_name;

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [60]:
%%sql

desc emp;

 * mysql+mysqlconnector://root:***@localhost/sample
5 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, ''),
 ('email', 'varchar(100)', 'YES', '', None, '')]

In [61]:
%%sql

alter table emp rename to employee ;

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [63]:
%%sql

desc employee;

 * mysql+mysqlconnector://root:***@localhost/sample
5 rows affected.

[('employee_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'YES', '', None, ''),
 ('email', 'varchar(100)', 'YES', '', None, '')]

In [67]:
%%sql

create database uber;

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [2]:
%%sql

use uber;

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [69]:
%%sql

create table uber.rides(
    ride_id int primary key,
    driver_id int,
    rider_id int,
    pickup_loc varchar(100),
    drop_loc varchar(100),
    ride_date datetime,
    fare decimal(10,2)
);

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [70]:
%%sql

INSERT INTO uber.rides (ride_id, driver_id, rider_id, pickup_loc, drop_loc, ride_date, fare) VALUES
(1, 101, 501, 'Chennai', 'Coimbatore', '2025-05-20 08:30:00', 500.00),
(2, 102, 502, 'Bangalore', 'Hyderabad', '2025-05-19 14:15:00', 700.00),
(3, 103, 503, 'Chennai', 'Madurai', '2025-05-18 09:00:00', 500.00),
(4, 104, 504, 'Coimbatore', 'Chennai', '2025-05-17 20:45:00', 600.00),
(5, 105, 505, 'Bangalore', 'Coimbatore', '2025-05-16 11:10:00', 800.00);

 * mysql+mysqlconnector://root:***@localhost/sample
5 rows affected.

[]

In [71]:
%%sql

select * from rides;

 * mysql+mysqlconnector://root:***@localhost/sample
5 rows affected.

[(1, 101, 501, 'Chennai', 'Coimbatore', datetime.datetime(2025, 5, 20, 8, 30), Decimal('500.00')),
 (2, 102, 502, 'Bangalore', 'Hyderabad', datetime.datetime(2025, 5, 19, 14, 15), Decimal('700.00')),
 (3, 103, 503, 'Chennai', 'Madurai', datetime.datetime(2025, 5, 18, 9, 0), Decimal('500.00')),
 (4, 104, 504, 'Coimbatore', 'Chennai', datetime.datetime(2025, 5, 17, 20, 45), Decimal('600.00')),
 (5, 105, 505, 'Bangalore', 'Coimbatore', datetime.datetime(2025, 5, 16, 11, 10), Decimal('800.00'))]

In [73]:
%%sql

select * from rides 
where fare > 500.00;

 * mysql+mysqlconnector://root:***@localhost/sample
3 rows affected.

[(2, 102, 502, 'Bangalore', 'Hyderabad', datetime.datetime(2025, 5, 19, 14, 15), Decimal('700.00')),
 (4, 104, 504, 'Coimbatore', 'Chennai', datetime.datetime(2025, 5, 17, 20, 45), Decimal('600.00')),
 (5, 105, 505, 'Bangalore', 'Coimbatore', datetime.datetime(2025, 5, 16, 11, 10), Decimal('800.00'))]

In [74]:
%%sql

desc rides;

 * mysql+mysqlconnector://root:***@localhost/sample
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'YES', '', None, ''),
 ('rider_id', 'int', 'YES', '', None, ''),
 ('pickup_loc', 'varchar(100)', 'YES', '', None, ''),
 ('drop_loc', 'varchar(100)', 'YES', '', None, ''),
 ('ride_date', 'datetime', 'YES', '', None, ''),
 ('fare', 'decimal(10,2)', 'YES', '', None, '')]

In [78]:
%%sql

select * from rides 
where fare > 500.00
order by fare desc;

 * mysql+mysqlconnector://root:***@localhost/sample
3 rows affected.

[(5, 105, 505, 'Bangalore', 'Coimbatore', datetime.datetime(2025, 5, 16, 11, 10), Decimal('800.00')),
 (2, 102, 502, 'Bangalore', 'Hyderabad', datetime.datetime(2025, 5, 19, 14, 15), Decimal('700.00')),
 (4, 104, 504, 'Coimbatore', 'Chennai', datetime.datetime(2025, 5, 17, 20, 45), Decimal('600.00'))]

In [81]:
%%sql 

select * from rides 
where fare > '500' and drop_loc = 'Coimbatore'
order by fare desc;

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[(5, 105, 505, 'Bangalore', 'Coimbatore', datetime.datetime(2025, 5, 16, 11, 10), Decimal('800.00'))]

In [82]:
%%sql

create table cab(
    ride_id int primary key,
    driver_id int not null,
    rider_id int not null,
    pickup_loc varchar(100) not null,
    drop_loc varchar(100) not null,
    ride_date datetime not null,
    fare decimal(10,2) not null
);

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [94]:
%%sql

INSERT INTO cab(ride_id, driver_id, rider_id, pickup_loc, drop_loc, ride_date, fare) VALUES
(2, 101, 502, 'Chennai', 'Coimbatore', '2025-05-20 08:30:00', 500.00);

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [95]:
%%sql 

select * from cab;

 * mysql+mysqlconnector://root:***@localhost/sample
2 rows affected.

[(2, 101, 501, 'Chennai', 'Coimbatore', datetime.datetime(2025, 5, 20, 8, 30), Decimal('500.00')),
 (2, 101, 502, 'Chennai', 'Coimbatore', datetime.datetime(2025, 5, 20, 8, 30), Decimal('500.00'))]

In [90]:
%%sql

drop table cab;
create table cab(
    ride_id int,
    driver_id int not null,
    rider_id int not null,
    pickup_loc varchar(100) not null,
    drop_loc varchar(100) not null,
    ride_date datetime not null,
    fare decimal(10,2) not null,
    primary key(ride_id,rider_id)
);

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.
0 rows affected.

[]

In [96]:
%%sql

desc cab;

 * mysql+mysqlconnector://root:***@localhost/sample
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'NO', '', None, ''),
 ('rider_id', 'int', 'NO', 'PRI', None, ''),
 ('pickup_loc', 'varchar(100)', 'NO', '', None, ''),
 ('drop_loc', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [97]:
%%sql 

create table users(
    user_id int primary key,
    email varchar(100) unique
);

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [98]:
%%sql 

insert into users(user_id,email)
values(1,"shreepurvaja@gmail.com");

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [100]:
%%sql 

insert into users(user_id,email)
values(2,"purvaja@gmail.com");

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [101]:
%%sql 

select * from users;

 * mysql+mysqlconnector://root:***@localhost/sample
2 rows affected.

[(2, 'purvaja@gmail.com'), (1, 'shreepurvaja@gmail.com')]

In [102]:
%%sql 

drop table users;
create table users(
    user_id int primary key,
    email varchar(100) unique,
    age int check(age > 18)
);

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.
0 rows affected.

[]

In [107]:
%%sql 

insert into users(user_id,email,age)
values(1,"shreepurvaja@gmail.com",19);

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [108]:
%%sql 

select * from users;

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[(1, 'shreepurvaja@gmail.com', 19)]

In [8]:
%%sql

drop table cab;
drop table drivers;
create table drivers(
    driver_id int primary key,
    driver_name varchar(100) not null,
    liscence_number varchar(50) unique
);

create table cab(
    ride_id int primary key,
    driver_id int not null,
    rider_id int not null,
    pickup_loc varchar(100) not null,
    drop_loc varchar(100) not null,
    ride_date datetime not null,
    fare decimal(10,2) not null,
    foreign key(driver_id) references drivers(driver_id)
);

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [9]:
%%sql 

desc drivers;

 * mysql+mysqlconnector://root:***@localhost/sample
3 rows affected.

[('driver_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_name', 'varchar(100)', 'NO', '', None, ''),
 ('liscence_number', 'varchar(50)', 'YES', 'UNI', None, '')]

In [10]:
%%sql 

desc cab;

 * mysql+mysqlconnector://root:***@localhost/sample
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'NO', 'MUL', None, ''),
 ('rider_id', 'int', 'NO', '', None, ''),
 ('pickup_loc', 'varchar(100)', 'NO', '', None, ''),
 ('drop_loc', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [16]:
%%sql 

insert into drivers(driver_id,driver_name,liscence_number)
values(1,"Gowtham","GDSP212606");

 * mysql+mysqlconnector://root:***@localhost/sample
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '1' for key 'drivers.PRIMARY'
[SQL: insert into drivers(driver_id,driver_name,liscence_number)
values(1,"Gowtham","GDSP212606");]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [22]:
%%sql

update drivers set driver_id=101 where liscence_number="GDSP212606";

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [23]:
%%sql

INSERT INTO cab(ride_id, driver_id, rider_id, pickup_loc, drop_loc, ride_date, fare) VALUES
(1, 101, 502, 'Chennai', 'Coimbatore', '2025-05-20 08:30:00', 500.00);

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [24]:
%%sql 

select * from cab;

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[(1, 101, 502, 'Chennai', 'Coimbatore', datetime.datetime(2025, 5, 20, 8, 30), Decimal('500.00'))]

In [26]:
%%sql

INSERT INTO cab(ride_id, driver_id, rider_id, pickup_loc, drop_loc, ride_date, fare) VALUES
(2, 102, 502, 'Chennai', 'Coimbatore', '2025-05-20 08:30:00', 500.00);

 * mysql+mysqlconnector://root:***@localhost/sample
(mysql.connector.errors.IntegrityError) 1452 (23000): Cannot add or update a child row: a foreign key constraint fails (`uber`.`cab`, CONSTRAINT `cab_ibfk_1` FOREIGN KEY (`driver_id`) REFERENCES `drivers` (`driver_id`))
[SQL: INSERT INTO cab(ride_id, driver_id, rider_id, pickup_loc, drop_loc, ride_date, fare) VALUES
(2, 102, 502, 'Chennai', 'Coimbatore', '2025-05-20 08:30:00', 500.00);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [30]:
%%sql

delete from drivers where driver_id=101;

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [31]:
%%sql 

select * from drivers;

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [33]:
%%sql

drop table cab;
drop table drivers;
create table drivers(
    driver_id int primary key,
    driver_name varchar(100) not null,
    liscence_number varchar(50) unique
);

create table cab(
    ride_id int primary key,
    driver_id int not null,
    rider_id int not null,
    pickup_loc varchar(100) not null,
    drop_loc varchar(100) not null,
    ride_date datetime not null,
    fare decimal(10,2) not null,
    foreign key(driver_id) references drivers(driver_id) on delete cascade
);

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [34]:
%%sql 

insert into drivers(driver_id,driver_name,liscence_number)
values(101,"Gowtham","GDSP212606");

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [35]:
%%sql

INSERT INTO cab(ride_id, driver_id, rider_id, pickup_loc, drop_loc, ride_date, fare) VALUES
(1, 101, 502, 'Chennai', 'Coimbatore', '2025-05-20 08:30:00', 500.00);

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [36]:
%%sql

delete from drivers where driver_id=101;

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [38]:
%%sql 

select * from cab;

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [39]:
%%sql

drop table cab;
drop table drivers;
create table drivers(
    driver_id int primary key,
    driver_name varchar(100) not null,
    liscence_number varchar(50) unique
);

create table cab(
    ride_id int primary key,
    driver_id int not null,
    rider_id int not null,
    pickup_loc varchar(100) not null,
    drop_loc varchar(100) not null,
    ride_date datetime not null,
    fare decimal(10,2) not null,
    foreign key(driver_id) references drivers(driver_id) 
);

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [40]:
%%sql 

insert into drivers(driver_id,driver_name,liscence_number)
values(101,"Gowtham","GDSP212606");

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [41]:
%%sql

INSERT INTO cab(ride_id, driver_id, rider_id, pickup_loc, drop_loc, ride_date, fare) VALUES
(1, 101, 502, 'Chennai', 'Coimbatore', '2025-05-20 08:30:00', 500.00);

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [42]:
%%sql 

select * from cab;

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[(1, 101, 502, 'Chennai', 'Coimbatore', datetime.datetime(2025, 5, 20, 8, 30), Decimal('500.00'))]

In [43]:
%%sql 

alter table cab add column is_delete boolean default false;

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [44]:
%%sql

update cab set is_delete=true where driver_id=101;

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [45]:
%%sql 

select * from cab;

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[(1, 101, 502, 'Chennai', 'Coimbatore', datetime.datetime(2025, 5, 20, 8, 30), Decimal('500.00'), 1)]

In [3]:
%%sql

create table demo1(
    sno int,
    name varchar(100),
    country varchar(100) default 'India'
);

 * mysql+mysqlconnector://root:***@localhost/sample
0 rows affected.

[]

In [4]:
%%sql

insert into demo1(sno,name) values(1,"Purvaja");

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [5]:
%%sql

select * from demo1;

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[(1, 'Purvaja', 'India')]

In [6]:
%%sql

insert into demo1(sno,name,country) values(2,"Shree","USA");

 * mysql+mysqlconnector://root:***@localhost/sample
1 rows affected.

[]

In [7]:
%%sql

select * from demo1;

 * mysql+mysqlconnector://root:***@localhost/sample
2 rows affected.

[(1, 'Purvaja', 'India'), (2, 'Shree', 'USA')]